package com.sharkz.datastorage.encrypt;

/**
 * ================================================
 * 作    者：SharkZ
 * 邮    箱：229153959@qq.com
 * 创建日期：2020-02-11  13:56
 * 描    述 AES加密是一种高级加密标准，是一种区块加密标准。它是一个对称密码，就是说加密和解密用相同的密钥。
 * WPA/WPA2经常用的加密方式就是AES加密算法。高级加密标准（英语：Advanced Encryption Standard，缩写：AES），
 * 在密码学中又称Rijndael加密法，是美国联邦政府采用的一种区块加密标准。 这个标准用来替代原先的DES，
 * 已经被多方分析且广为全世界所使用，Android 中的AES 加密 秘钥 key 必须为16/24/32位字节，否则抛异常。
 * 修订历史：
 * ================================================
 */
public class AESTool {

}
